(function() {
    // 1实例化对象
    var myChart = echarts.init(document.querySelector(".bar .chart"));
    // 2. 指定配置项和数据
    var option = {
        title: {text: ''},
        legend: {left: 'right'},
        tooltip:{},
        dataset:{
            source:[
                {"日期":"2020/3/3","累计确诊":10614,"累计死亡":164},
                {"日期":"2020/3/4","累计确诊":12621,"累计死亡":218},
                {"日期":"2020/3/5","累计确诊":14942,"累计死亡":268},
                {"日期":"2020/3/6","累计确诊":18070,"累计死亡":341},
                {"日期":"2020/3/7","累计确诊":21302,"累计死亡":418},
                {"日期":"2020/3/8","累计确诊":24677,"累计死亡":502},
                {"日期":"2020/3/9","累计确诊":28165,"累计死亡":706},
                {"日期":"2020/3/10","累计确诊":32555,"累计死亡":878},
                {"日期":"2020/3/11","累计确诊":37449,"累计死亡":1136},
                {"日期":"2020/3/12","累计确诊":43787,"累计死亡":1456},
                {"日期":"2020/3/13","累计确诊":52427,"累计死亡":1793},
                {"日期":"2020/3/14","累计确诊":62422,"累计死亡":2226},
                {"日期":"2020/3/15","累计确诊":73528,"累计死亡":2623},
                {"日期":"2020/3/16","累计确诊":86485,"累计死亡":3287},
                {"日期":"2020/3/17","累计确诊":100286,"累计死亡":3926},
                {"日期":"2020/3/18","累计确诊":114963,"累计死亡":4675},
                {"日期":"2020/3/19","累计确诊":134946,"累计死亡":5615},
                {"日期":"2020/3/20","累计确诊":161783,"累计死亡":6672},
                {"日期":"2020/3/21","累计确诊":192615,"累计死亡":7988},
                {"日期":"2020/3/22","累计确诊":222707,"累计死亡":9629},
                {"日期":"2020/3/23","累计确诊":254499,"累计死亡":11307},
                {"日期":"2020/3/24","累计确诊":294736,"累计死亡":13012},
                {"日期":"2020/3/25","累计确诊":337406,"累计死亡":15259},
                {"日期":"2020/3/26","累计确诊":383722,"累计死亡":17656},
                {"日期":"2020/3/27","累计确诊":444465,"累计死亡":20391},
                {"日期":"2020/3/28","累计确诊":522343,"累计死亡":24531},
                {"日期":"2020/3/29","累计确诊":579417,"累计死亡":27029}
            ]
        },
        xAxis: {type: 'category'},
        yAxis: {type: 'value'},
        dataZoom: [
            {
                type: 'slider',
                xAxisIndex: 0,
                start: 0,
                end: 100
            },
            {
                type: 'slider',
                yAxisIndex: 0,
                start: 0,
                end: 100
            },
        ],
        series: [
            {type: 'bar'},
            {type: 'bar'},
        ]
    };

    myChart.setOption(option);
    window.addEventListener("resize", function() {
        myChart.resize();
    });
})();
(function() {
    // 1实例化对象
    var myChart = echarts.init(document.querySelector(".bar2 .chart"));
    // 2. 指定配置项和数据
    var option = {
        title: {text: '中国累积确诊和累积死亡人数'},
        legend: {left: 'right'},
        tooltip:{},
        dataset:{
            source:[
                {"日期":"2020/3/3","确诊":80270,"死亡":2981},
                {"日期":"2020/3/4","确诊":80409,"死亡":3012},
                {"日期":"2020/3/5","确诊":80552,"死亡":3042},
                {"日期":"2020/3/6","确诊":80651,"死亡":3070},
                {"日期":"2020/3/7","确诊":80695,"死亡":3097},
                {"日期":"2020/3/8","确诊":80735,"死亡":3119},
                {"日期":"2020/3/9","确诊":80754,"死亡":3136},
                {"日期":"2020/3/10","确诊":80778,"死亡":3158},
                {"日期":"2020/3/11","确诊":80793,"死亡":3169},
                {"日期":"2020/3/12","确诊":80813,"死亡":3176},
                {"日期":"2020/3/13","确诊":80824,"死亡":3189},
                {"日期":"2020/3/14","确诊":80844,"死亡":3199},
                {"日期":"2020/3/15","确诊":80860,"死亡":3213},
                {"日期":"2020/3/16","确诊":80881,"死亡":3226},
                {"日期":"2020/3/17","确诊":80894,"死亡":3237},
                {"日期":"2020/3/18","确诊":80928,"死亡":3245},
                {"日期":"2020/3/19","确诊":80967,"死亡":3248},
                {"日期":"2020/3/20","确诊":81008,"死亡":3255},
                {"日期":"2020/3/21","确诊":81054,"死亡":3261},
                {"日期":"2020/3/22","确诊":81093,"死亡":3270},
                {"日期":"2020/3/23","确诊":81171,"死亡":3277},
                {"日期":"2020/3/24","确诊":81218,"死亡":3281},
                {"日期":"2020/3/25","确诊":81285,"死亡":3287},
                {"日期":"2020/3/26","确诊":81340,"死亡":3292},
                {"日期":"2020/3/27","确诊":81394,"死亡":3295},
                {"日期":"2020/3/28","确诊":81439,"死亡":3300}
            ]
        },
        xAxis: {type: 'category'},
        yAxis: {type: 'value'},
        dataZoom: [
            {
                type: 'slider',
                xAxisIndex: 0,
                start: 0,
                end: 100
            },
            {
                type: 'slider',
                yAxisIndex: 0,
                start: 0,
                end: 100
            },
        ],
        series: [
            {type: 'bar'},
            {type: 'bar'},
        ]
    };

    myChart.setOption(option);
    window.addEventListener("resize", function() {
        myChart.resize();
    });
})();

(function() {
    // 1实例化对象
    var myChart = echarts.init(document.querySelector(".bar3D .chart"),'light');
    // 2. 指定配置项和数据
    $.get('data/conv19.json', function (data) {
        option = {
            grid3D: {
                boxWidth: 200,
                boxDepth: 100
            },
            tooltip: {},
            xAxis3D: {
                name:'国家',
                nameGap:30,
                type: 'category',
                axisLabel:{interval : '0'}
            },
            yAxis3D: {
                name:'日期',
                nameGap:30,
                type: 'category',
                axisLabel:{interval : 'auto'}
            },
            zAxis3D: {
                name:'确诊人数',
                nameGap:30
            },
            visualMap: {
                max: 125000,
                dimension: 'confirmed'
            },
            dataset: {
                dimensions: [
                    'confirmed',
                    'dead',
                    'country',
                    {name: 'date', type: 'ordinal'}
                ],
                source: data
            },
            series: [
                {
                    type: 'bar3D',
                    //symbolSize: symbolSize,
                    shading: 'lambert',
                    encode: {
                        x: 'country',
                        y: 'date',
                        z: 'confirmed',
                        tooltip: [0, 1, 2, 3]
                    }
                }
            ]
        };

        myChart.setOption(option);
    });

    myChart.setOption(option);
    window.addEventListener("resize", function() {
        myChart.resize();
    });
})();

